In [1]:
import pandas as pd
import numpy as np

import pyodbc as odbc
# import sqlalchemy

In [2]:
server = 'conapp02'
database = 'CSBInventoryDW'
username = 'CONESTOGAMEATS\msmetanin'
password = open('mydata.txt', 'r').read()
cnxn = odbc.connect('DRIVER={SQL Server}; SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password, trusted_connection='yes')
cursor = cnxn.cursor()
print(cursor)

cursor.execute("SELECT table_name FROM information_schema.tables")
for table_name in cursor:
   print(table_name)

<pyodbc.Cursor object at 0x000001A3B9476D30>
('PiecesByDay', )
('CarlisleUpperLowerTreshhold', )
('Giveaway', )
('HogGradingDataGrouped', )
('ProductionByHour', )
('HotDressScaleData', )
('CutSheetSnapshot', )
('HogGradingData', )
('CutSheetChanges', )
('AutoFomData', )
('Genetics', )

## Hogs Grading

In [5]:
query = '''
SELECT
--KillDate,
Tattoo,
Qualificationcode,
COUNT(MuscleDepth) as Hogs_Count,
AVG(HotWeightKg) as AVG_HDW


From HogGradingData

where Killdate between ? and ?

GROUP BY Tattoo, Qualificationcode

ORDER BY Tattoo, Qualificationcode DESC
'''
query_params = ['20230420', '20230421']
hogs_count = pd.read_sql(query, cnxn, params = query_params)
hogs_count

C:\Users\msmetanin\AppData\Local\Temp\ipykernel_22688\3756423147.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  hogs_count = pd.read_sql(query, cnxn, params = query_params)

,Tattoo,Qualificationcode,Hogs_Count,AVG_HDW
0,10165,No Grade,17,116.129411
1,10165,0,243,114.004938
2,10185,No Grade,13,109.338461
3,10185,0,27,114.496296
4,10255,No Grade,17,111.711764
...,...,...,...,...
181,89907,No Grade,11,103.036363
182,89907,0,99,106.158585
183,92257,No Grade,9,110.455555
184,92257,0,56,109.537500
185,XXX,0,15,108.200000

In [14]:
query = '''
SELECT
KillDate,
Count(KillDate) as Count_Hogs,
AVG(HotWeightKg) as AVG_HDW
From HogGradingData

where Killdate between ? and ?

GROUP BY KillDate
'''
query_params = ['20230420', '20230422']
hogs_count = pd.read_sql(query, cnxn, params = query_params)
print("columns List: ", hogs_count.columns)
# print("Imputed count: ", hogs_count.loc['KillTime' == "0:00:00 AM"])
# print('Hogs Killed: ', hogs_count.QualificationCode.count())
hogs_count

C:\Users\msmetanin\AppData\Local\Temp\ipykernel_22688\2517852221.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  hogs_count = pd.read_sql(query, cnxn, params = query_params)

columns List:  Index(['KillDate', 'Count_Hogs', 'AVG_HDW'], dtype='object')

     KillDate  Count_Hogs     AVG_HDW
0  2023-04-20        8558  109.191399
1  2023-04-21        8414  110.870929
2  2023-04-22        4708  111.941567

In [43]:
query = '''
SELECT
KillDate,
KillTime as stationtime,
Tattoo,
HotWeightkg,
Qualificationcode

From HogGradingData

where Killdate between ? and ?

--GROUP BY KillDate
'''
query_params = ['20230410', '20230410']
hogs_count = pd.read_sql(query, cnxn, params = query_params)
hogs_count

C:\Users\msmetanin\AppData\Local\Temp\ipykernel_29320\942109085.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  hogs_count = pd.read_sql(query, cnxn, params = query_params)

,KillDate,stationtime,Tattoo,HotWeightkg,Qualificationcode
0,2023-04-10,2023-04-10 10:48:03,20855,102.7,0
1,2023-04-10,2023-04-10 10:48:08,20855,98.7,0
2,2023-04-10,2023-04-10 10:48:14,20855,82.1,0
3,2023-04-10,2023-04-10 10:48:19,20855,91.1,0
4,2023-04-10,2023-04-10 10:48:23,20855,95.0,0
...,...,...,...,...,...
8568,2023-04-10,2023-04-10 00:00:00,57575,116.1,No Grade
8569,2023-04-10,2023-04-10 00:00:00,57575,116.1,No Grade
8570,2023-04-10,2023-04-10 00:00:00,57575,116.1,No Grade
8571,2023-04-10,2023-04-10 00:00:00,57575,116.1,No Grade
8572,2023-04-10,2023-04-10 00:00:00,57575,116.1,No Grade

## Autofom Import

In [4]:
query = '''SELECT
            KillDate,
            COUNT(VendorKey)
            FROM AutoFomData
            WHERE KillDate between ? and ?
            GROUP BY KillDate
            '''

df_atfm = pd.read_sql(query, cnxn, params = ['20230420', '20230430'])
df_atfm

C:\Users\msmetanin\AppData\Local\Temp\ipykernel_24336\201702377.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_atfm = pd.read_sql(query, cnxn, params = ['20230420', '20230430'])

   KillDate
0  20230420  8558
1  20230421  8570
2  20230422  4782
3  20230424  8567
4  20230425  8560
5  20230426  8571

## Join Atutofom and Genetic table

In [ ]:
query = '''
Select '''

## Genetics

In [5]:
query = '''
select *
from Genetics
'''
df_gen = pd.read_sql(query, cnxn)
df_gen

C:\Users\msmetanin\AppData\Local\Temp\ipykernel_24336\2176209790.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_gen = pd.read_sql(query, cnxn)

,MemberID,MemberName,PPPNumber,ProducerName,Tattoo,DamLine,SireLine
0,1,Test Member #1,1112,None,None,None,None
1,403,BASBARN FARMS,8002,Basbarn Farms,None,None,None
2,404,"VAN ROOIJEN, JOHN",8005,Van Rooijen Farms Ltd.,None,None,None
3,405,J.M.S. BOERE FARMS LTD.,8006,JMS Boere Farms Ltd.,None,None,None
4,406,BEN ZEGERS,8011,1551870 Ontario Inc.,None,None,None
...,...,...,...,...,...,...,...
8719,697,Milagre Farms,5003,Milagre Farms,37367,Topigs Norsvin - TN70,Hypor - Magnus
8720,697,Milagre Farms,5003,Milagre Farms,51875,Topigs Norsvin - TN70,Hypor - Magnus
8721,697,Milagre Farms,5003,Milagre Farms,58057,Topigs Norsvin - TN70,Hypor - Magnus
8722,697,Milagre Farms,5003,Milagre Farms,73555,Topigs Norsvin - TN70,Hypor - Magnus
8723,700,Milagre Farms,9072,None,None,Topigs Norsvin - TN70,Hypor - Magnus